//********************************************************************
//*               BIND - BIND THE DB2 PACKAGE                        *
//********************************************************************
//BINDPKG JOB 'WD-PKGBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID
//JOBLIB   DD  DISP=SHR,
//             DSN=DBC0CFG.DB2.V12.SDSNLOAD
//PKGBIND EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSTSIN  DD  *
//* epscmort_db2_config
//* {}
//* {'apiVersion': 'deploy.ibm.com/v1', 'kind': 'Environment', 'metadata': {'name': 'EOLEB7-Integration', 'version': '1.0.0'}, 'application': 'mortgageapplication', 'hlq': 'IBMUSER.WD.TEST', 'uss_root': '/tmp/wazi-deploy/int', 'deploy_cfg_home': '../../', 'default_cics_user': 'IBMUSER', 'default_cics_password': 'sys1', 'default_cics_context': 'CICS01', 'default_cmci_host': '127.0.0.1', 'default_cmci_port': 1490, 'default_cmci_scheme': 'http', 'default_csd_group': 'DEFAULT', 'default_cics_cmci_action': 'NEWCOPY', 'default_env_cics_sdfhload': 'CICSTS.V5R5.CICS.SDFHLOAD', 'default_env_cics_csd': 'CICSGUSR.CICS.CICS01.DFHCSD', 'default_cmci_insecure': False, 'default_cmci_cert': '', 'default_cmci_key': '', 'default_db2_sdsnload': 'DBC0CFG.DB2.V12.SDSNLOAD', 'default_pkg_jobcard': "BINDPKG JOB 'WD-PKGBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID", 'default_plan_jobcard': "BINDPLA JOB 'WD-PLANBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID", 'default_db2_sqlid': 'IBMUSER', 'default_db2_package': 'DEFAULT', 'default_db2_plan': 'DEFAULT', 'default_db2_qualifier': 'QUAL', 'default_db2_subsys': 'DBC1', 'default_db2_plan_pklist': '*.CBSAPK.*', 'default_db2_action': 'REPLACE', 'default_zos_connect_root': '/var/zosconnect/servers/integration/wazideploy-cics', 'default_zos_connect_job_name': 'BAQSERV2', 'include_global_config': {'files_list': ['../..//deployment-configuration/global/global_initialization.yml'], 'files_must_exist': True}, 'run_jcl_expert': False, 'working_folder': '/u/dbehm/wazi-deploy-include-var-tests/ts1_alternate_bind_approach/dbb/WaziDeploy/zDeploy/test/python/ts1_full_deploy.sh_logs/2026-09-03_11-20-32', 'current_user': 'DBEHM', 'current_user_home': '/u/dbehm', 'current_activity_name': 'DBRMS2', 'deploy_timestamp': '20260903.092034.296', 'wd_deployment_plan': {'apiVersion': 'deploy.ibm.com/v1', 'kind': 'DeploymentPlan', 'metadata': {'name': 'mortgageapplication-rel-1.1.0-13179.tar', 'description': 'mortgageapplication-rel-1.1.0-13179.tar', 'annotations': {'creation_timestamp': '20260903.092033.820', 'engine': {'version': '3.0.8.1', 'build': '12', 'date': 'Tue Aug 11 07:05:19 UTC 2026'}, 'package': {'path': '/u/dbehm/wazi-deploy-include-var-tests/ts1_alternate_bind_approach/dbb/WaziDeploy/zDeploy/test/python/ts1_full_deploy.sh_logs/2026-09-03_11-20-32/applicationArchive.tar', 'sha256': '5898de1cea6c8b9af9a7f55405f021d01898c44febd50f6931bbd8ae8681eb48'}}}, 'activities': [{'name': 'LOAD_CONFIG', 'description': 'Load the generic Wazi Deploy Configuration variables\nSpecific for the Python implementation', 'properties': [], 'actions': [{'name': 'READ_CONFIGURATION', 'properties': [], 'steps': [{'name': 'INCLUDE_GLOBAL_CONFIG', 'description': 'Load global include configuration global_initialization.yml from central location', 'properties': [{'key': 'template', 'value': 'include_vars'}, {'key': 'var_include_vars', 'value': 'include_global_config'}], 'artifacts': [], 'types': [], 'short_name': 'INCLUDE_GLOBAL_CFG'}, {'name': 'INCLUDE_APPLICATION_VARIABLES', 'description': 'Load environment specific application overrides from central location', 'properties': [{'key': 'template', 'value': 'include_vars'}, {'key': 'var_include_vars', 'value': 'include_application_vars'}], 'artifacts': [], 'types': [], 'short_name': 'INCLUDE_APP_VARS'}, {'name': 'INCLUDE_MIDDLEWARE_CONFIG', 'description': 'Load global middleware configuration configuring the Wazi Deploy building blocks', 'properties': [{'key': 'template', 'value': 'include_vars'}, {'key': 'var_include_vars', 'value': 'include_middleware_cfg'}], 'artifacts': [], 'types': [], 'short_name': 'INCLUDE_MIDDLEWARE_CFG'}, {'name': 'INCLUDE_COMMON_CONFIG', 'description': 'Load global configuration for Wazi Deploy Core building blocks such as type mappings and dataset configurations', 'properties': [{'key': 'template', 'value': 'include_vars'}, {'key': 'var_include_vars', 'value': 'include_common_cfg'}], 'artifacts': [], 'types': [], 'short_name': 'INCLUDE_COMMON_CFG'}], 'types': [], 'short_name': 'READ_CONFIG'}], 'types': [], 'short_name': 'LOAD_CONFIG', 'tags': ['always']}, {'name': 'PACKAGE', 'description': 'This activity expands the package into the working directory', 'properties': [], 'actions': [{'name': 'EXPAND_PACKAGE', 'properties': [], 'steps': [{'name': 'PACKAGE', 'properties': [], 'artifacts': [], 'types': []}], 'types': [], 'short_name': 'EXPAND_PACKAGE'}], 'types': [], 'short_name': 'PACKAGE', 'tags': ['always']}, {'name': 'DBRMS2', 'description': 'This activity is dedicated to DBRM bind modules and will process DBRM members of the package first using dedicated PDS libraries', 'properties': [], 'actions': [{'name': 'BIND_VARS', 'description': 'Loads bind variables', 'properties': [], 'steps': [{'name': 'LOAD', 'description': 'Loads individual bind parms from package configuration file', 'properties': [{'key': 'template', 'value': 'include_vars'}, {'key': 'var_include_vars', 'value': 'db2_individual_include_vars_config'}], 'artifacts': [{'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM'}], 'loop': {'loop_query': 'wd_query[[ current_plan_step.artifacts[].name ]]', 'loop_var': 'dbrm_member'}, 'is_artifact': True, 'types': [], 'short_name': 'LOAD'}], 'is_artifact': True, 'types': [{'name': 'DBRM'}], 'short_name': 'BIND_VARS'}, {'name': 'INDIVIDUAL_BIND', 'description': 'Run a Db2 bind operation for every member. Checking for available member level overrides configurations.', 'properties': [], 'steps': [{'name': 'MEMBER_COPY', 'description': "This step copies DBRMs into temporary PDS library. See 'type_dbrm_temp'", 'properties': [{'key': 'var_type', 'value': 'type_dbrm_temp'}], 'artifacts': [{'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM'}], 'types': [], 'short_name': 'MEMBER_COPY'}, {'name': 'DB2_BIND', 'description': 'This step references a template to set db2 bind operations. For both Bind Plan and Bind Package', 'properties': [{'key': 'template', 'value': 'db2_bind_package'}, {'key': 'var_template_name', 'value': 'db2_individual_job_template'}], 'artifacts': [{'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM', 'target': 'IBMUSER.WD.TEST.DBRM'}], 'loop': {'loop_query': 'current_plan_step.artifacts', 'loop_var': 'artifact'}, 'is_artifact': True, 'types': [], 'short_name': 'DB2_BIND'}], 'is_artifact': True, 'types': [{'name': 'DBRM'}], 'short_name': 'INDIVIDUAL_BIND'}], 'is_artifact': True, 'types': [{'name': 'DBRM'}], 'short_name': 'DBRMS2', 'tags': ['db2']}, {'name': 'DEPLOY_MODULES', 'description': 'This activity is deploys artifacts into the target PDS libraries', 'properties': [], 'actions': [{'name': 'UPDATE', 'description': 'This action is applicable when we add new or changed artifacts.', 'properties': [], 'steps': [{'name': 'MEMBER_ARCHIVE', 'description': 'This step backs up already installed artifacts into the backup PDS', 'properties': [], 'artifacts': [{'name': 'EPSMLIS', 'properties': [{'key': 'path', 'value': './bin/mapload/EPSMLIS.MAPLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'MAPLOAD'}], 'hash': '4411788da85715120a6ac7f9eca6b35fe78157be8a5c122590b1567d36a7cbe6', 'type': 'MAPLOAD', 'path': './bin/mapload/EPSMLIS.MAPLOAD'}, {'name': 'EPSMLIST', 'properties': [{'key': 'path', 'value': './bin/cicsload/EPSMLIST.CICSLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'CICSLOAD'}], 'hash': '699e98ec14b4a69ab2e868f7b8ee44bfc866fa9afd0fa8a3a5ec8a0fc31e9afb', 'type': 'CICSLOAD', 'path': './bin/cicsload/EPSMLIST.CICSLOAD'}, {'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM'}, {'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/cicsload/EPSCMORT.CICSLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'CICSLOAD'}], 'hash': 'c62addc540379ea9cb1dbd63d48e5845d6d683b8e0584f9f9c52ac4a31887e83', 'type': 'CICSLOAD', 'path': './bin/cicsload/EPSCMORT.CICSLOAD'}, {'name': 'EPSMPMT', 'properties': [{'key': 'path', 'value': './bin/load/EPSMPMT.LOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'LOAD'}], 'hash': 'c67196d6ef312107724a0db8aa20a13d5cef3d1d0f99e6a5d1d02d48b61c86d4', 'type': 'LOAD', 'path': './bin/load/EPSMPMT.LOAD'}, {'name': 'EPSMORT', 'properties': [{'key': 'path', 'value': './bin/mapload/EPSMORT.MAPLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'MAPLOAD'}], 'hash': 'e4e2cad6eb7c8ded6261cc07296fe14582e63cd67c9189a60b4e5eb8e3494e42', 'type': 'MAPLOAD', 'path': './bin/mapload/EPSMORT.MAPLOAD'}], 'types': [], 'short_name': 'MEMBER_ARCHIVE'}, {'name': 'MEMBER_COPY', 'description': 'This step do the copy of artifacts into PDSs', 'properties': [], 'artifacts': [{'name': 'EPSMLIS', 'properties': [{'key': 'path', 'value': './bin/mapload/EPSMLIS.MAPLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'MAPLOAD'}], 'hash': '4411788da85715120a6ac7f9eca6b35fe78157be8a5c122590b1567d36a7cbe6', 'type': 'MAPLOAD', 'path': './bin/mapload/EPSMLIS.MAPLOAD'}, {'name': 'EPSMLIST', 'properties': [{'key': 'path', 'value': './bin/cicsload/EPSMLIST.CICSLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'CICSLOAD'}], 'hash': '699e98ec14b4a69ab2e868f7b8ee44bfc866fa9afd0fa8a3a5ec8a0fc31e9afb', 'type': 'CICSLOAD', 'path': './bin/cicsload/EPSMLIST.CICSLOAD'}, {'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM'}, {'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/cicsload/EPSCMORT.CICSLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'CICSLOAD'}], 'hash': 'c62addc540379ea9cb1dbd63d48e5845d6d683b8e0584f9f9c52ac4a31887e83', 'type': 'CICSLOAD', 'path': './bin/cicsload/EPSCMORT.CICSLOAD'}, {'name': 'EPSMPMT', 'properties': [{'key': 'path', 'value': './bin/load/EPSMPMT.LOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'LOAD'}], 'hash': 'c67196d6ef312107724a0db8aa20a13d5cef3d1d0f99e6a5d1d02d48b61c86d4', 'type': 'LOAD', 'path': './bin/load/EPSMPMT.LOAD'}, {'name': 'EPSMORT', 'properties': [{'key': 'path', 'value': './bin/mapload/EPSMORT.MAPLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'MAPLOAD'}], 'hash': 'e4e2cad6eb7c8ded6261cc07296fe14582e63cd67c9189a60b4e5eb8e3494e42', 'type': 'MAPLOAD', 'path': './bin/mapload/EPSMORT.MAPLOAD'}], 'types': [], 'short_name': 'MEMBER_COPY'}], 'types': [], 'short_name': 'UPDATE'}], 'is_artifact': True, 'types': [{'name': 'LOAD'}, {'name': 'DBRM'}, {'name': 'CICSLOAD'}, {'name': 'MAPLOAD'}, {'name': 'JCL'}], 'short_name': 'DEPLOY_MODULES', 'tags': ['deploy']}, {'name': 'ROLLBACK_MODULES', 'description': "This action is applicable when when restoring files from the backup\ndatasets. It is only executed when plan_tags 'restore' is provided.", 'properties': [], 'actions': [{'name': 'RESTORE', 'description': 'Retrieve members from backup dataset', 'properties': [], 'steps': [{'name': 'MEMBER_RESTORE', 'description': 'This step restores the backup from the backup PDS', 'properties': [], 'artifacts': [{'name': 'EPSMLIS', 'properties': [{'key': 'path', 'value': './bin/mapload/EPSMLIS.MAPLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'MAPLOAD'}], 'hash': '4411788da85715120a6ac7f9eca6b35fe78157be8a5c122590b1567d36a7cbe6', 'type': 'MAPLOAD', 'path': './bin/mapload/EPSMLIS.MAPLOAD'}, {'name': 'EPSMLIST', 'properties': [{'key': 'path', 'value': './bin/cicsload/EPSMLIST.CICSLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'CICSLOAD'}], 'hash': '699e98ec14b4a69ab2e868f7b8ee44bfc866fa9afd0fa8a3a5ec8a0fc31e9afb', 'type': 'CICSLOAD', 'path': './bin/cicsload/EPSMLIST.CICSLOAD'}, {'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM'}, {'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/cicsload/EPSCMORT.CICSLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'CICSLOAD'}], 'hash': 'c62addc540379ea9cb1dbd63d48e5845d6d683b8e0584f9f9c52ac4a31887e83', 'type': 'CICSLOAD', 'path': './bin/cicsload/EPSCMORT.CICSLOAD'}, {'name': 'EPSMPMT', 'properties': [{'key': 'path', 'value': './bin/load/EPSMPMT.LOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'LOAD'}], 'hash': 'c67196d6ef312107724a0db8aa20a13d5cef3d1d0f99e6a5d1d02d48b61c86d4', 'type': 'LOAD', 'path': './bin/load/EPSMPMT.LOAD'}, {'name': 'EPSMORT', 'properties': [{'key': 'path', 'value': './bin/mapload/EPSMORT.MAPLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'MAPLOAD'}], 'hash': 'e4e2cad6eb7c8ded6261cc07296fe14582e63cd67c9189a60b4e5eb8e3494e42', 'type': 'MAPLOAD', 'path': './bin/mapload/EPSMORT.MAPLOAD'}], 'types': [], 'short_name': 'MEMBER_RESTORE'}], 'types': []}, {'name': 'BIND', 'description': 'This action runs Db2 Bind package and plan for restored DBRM members', 'properties': [], 'steps': [{'name': 'BIND_PACKAGE', 'description': 'This step performs the DB2 Bind package operations for restored DBRM members', 'properties': [{'key': 'template', 'value': 'db2_bind_package'}], 'artifacts': [{'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM'}], 'types': [], 'short_name': 'BIND_PACKAGE'}, {'name': 'BIND_PLAN', 'description': 'This step performs the DB2 Bind plan operations for restored DBRM members', 'properties': [{'key': 'template', 'value': 'db2_bind_plan'}], 'artifacts': [{'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM'}], 'types': [], 'short_name': 'BIND_PLAN'}], 'types': [{'name': 'DBRM'}]}], 'is_artifact': True, 'types': [{'name': 'LOAD'}, {'name': 'DBRM'}, {'name': 'CICSLOAD'}, {'name': 'MAPLOAD'}, {'name': 'JCL'}], 'short_name': 'ROLLBACK_MODULES', 'tags': ['restore', 'never']}, {'name': 'CICS_ACTIVATION', 'description': 'This activity is dedicated for deployed or restored CICS artifacts.', 'properties': [], 'actions': [{'name': 'UPDATE', 'description': 'Update CICS runtime', 'properties': [], 'steps': [{'name': 'PROG_UPDATE', 'description': 'Refreshes CICS programs and maps via the CMCI interface', 'properties': [{'key': 'template', 'value': 'cics_cmci_prog_update'}], 'artifacts': [{'name': 'EPSMLIS', 'properties': [{'key': 'path', 'value': './bin/mapload/EPSMLIS.MAPLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'MAPLOAD'}], 'hash': '4411788da85715120a6ac7f9eca6b35fe78157be8a5c122590b1567d36a7cbe6', 'type': 'MAPLOAD', 'path': './bin/mapload/EPSMLIS.MAPLOAD'}, {'name': 'EPSMLIST', 'properties': [{'key': 'path', 'value': './bin/cicsload/EPSMLIST.CICSLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'CICSLOAD'}], 'hash': '699e98ec14b4a69ab2e868f7b8ee44bfc866fa9afd0fa8a3a5ec8a0fc31e9afb', 'type': 'CICSLOAD', 'path': './bin/cicsload/EPSMLIST.CICSLOAD'}, {'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/cicsload/EPSCMORT.CICSLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'CICSLOAD'}], 'hash': 'c62addc540379ea9cb1dbd63d48e5845d6d683b8e0584f9f9c52ac4a31887e83', 'type': 'CICSLOAD', 'path': './bin/cicsload/EPSCMORT.CICSLOAD'}, {'name': 'EPSMORT', 'properties': [{'key': 'path', 'value': './bin/mapload/EPSMORT.MAPLOAD'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'MAPLOAD'}], 'hash': 'e4e2cad6eb7c8ded6261cc07296fe14582e63cd67c9189a60b4e5eb8e3494e42', 'type': 'MAPLOAD', 'path': './bin/mapload/EPSMORT.MAPLOAD'}], 'types': [], 'short_name': 'PROG_UPDATE'}], 'types': [], 'short_name': 'UPDATE'}], 'is_artifact': True, 'types': [{'name': 'CICSLOAD'}, {'name': 'MAPLOAD'}], 'short_name': 'CICS_ACTIVATION', 'tags': ['restore']}, {'name': 'DEPLOY_ZOS_CONNECT', 'description': 'This activity deals with IBM z/OS Connect artifacts', 'properties': [], 'actions': [{'name': 'ZOS_CONNECT_SERVER', 'description': 'Refresh z/OS Connect config and applications via a modify command', 'properties': [], 'steps': [{'name': 'REFRESH_CONFIG', 'properties': [{'key': 'template', 'value': 'system_command'}, {'key': 'var_system_command', 'value': 'system_command_refresh_config'}], 'artifacts': [], 'types': []}, {'name': 'REFRESH_APP', 'properties': [{'key': 'template', 'value': 'system_command'}, {'key': 'var_system_command', 'value': 'system_command_refresh_apps'}], 'artifacts': [], 'types': []}], 'types': []}], 'types': [], 'short_name': 'DEPLOY_ZOS_CONNECT'}], 'manifests': [{'name': 'mortgageapplication-rel-1.1.0-13179.tar', 'description': 'mortgageapplication-rel-1.1.0-13179.tar', 'annotations': {'creation_timestamp': '20260903.092033.333', 'package': '/u/dbehm/wazi-deploy-include-var-tests/_testTars/mortgageapplication-rel-1.1.0-13179.tar'}}], 'deployment_methods': [{'apiVersion': 'deploy.ibm.com/v1', 'kind': 'DeploymentMethod', 'metadata': {'name': 'CICS', 'description': 'This deployment method can be use for the deployment of an CICS application.', 'version': '1.0.0', 'annotations': {'deployVersion': '1.0.0'}}}], 'loop_vars': ['dbrm_member', 'artifact', 'jcl_member', 'api_name']}, 'include_application_vars': {'files_list': ['../..//environment-configuration/application-overrides/mortgageapplication/EOLEB7-Integration.yml'], 'files_must_exist': False}, 'include_middleware_cfg': {'files_list': ['../..//deployment-configuration/global/cics_config.yml', '../..//deployment-configuration/global/db2_config.yml', '../..//deployment-configuration/global/zos_connect.yml'], 'files_must_exist': True}, 'include_common_cfg': {'files_list': ['../..//deployment-configuration/global/jcl_verification.yml', '../..//deployment-configuration/global/pds_specification.yml', '../..//deployment-configuration/global/types_pattern_mapping.yml', '../..//deployment-configuration/global/db2_member_level_overrides.yml'], 'files_must_exist': True}, 'cics_sys_def': {'context': 'CICS01', 'cmci_user': 'IBMUSER', 'cmci_password': 'sys1', 'csd_group': 'DEFAULT', 'cmci_host': '127.0.0.1', 'cmci_port': '1490', 'scheme': 'http', 'insecure': False, 'cmci_cert': '', 'cmci_key': ''}, 'csd_update_template': {'src': '../..//deployment-configuration/templates/cics_csd_dfhcsdup.jcl.j2', 'encoding': 'IBM-1047', 'use_template': True, 'max_rc': 4, 'dest': '/u/dbehm/wazi-deploy-include-var-tests/ts1_alternate_bind_approach/dbb/WaziDeploy/zDeploy/test/python/ts1_full_deploy.sh_logs/2026-09-03_11-20-32/cics_csd_update/cics_csd_dfhcsdup.jcl', 'search_paths': ['/u/dbehm/wazi-deploy-include-var-tests/ts1_alternate_bind_approach/dbb/WaziDeploy/zDeploy/test/python/ts1_full_deploy.sh_logs/2026-09-03_11-20-32']}, 'cics_csd': 'CICSGUSR.CICS.CICS01.DFHCSD', 'cics_sdfhload': 'CICSTS.V5R5.CICS.SDFHLOAD', 'db2_sys_def': {'package_maxrc': 8, 'plan_maxrc': 8, 'sqlid': 'IBMUSER', 'package': 'DEFAULT', 'plan': 'DEFAULT', 'qualifier': 'QUAL', 'subsys': 'DBC1', 'package_jobcard': "BINDPKG JOB 'WD-PKGBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID", 'plan_jobcard': "BINDPLA JOB 'WD-PLANBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID", 'package_action': 'REPLACE', 'plan_action': 'REPLACE', 'sdsnload': 'DBC0CFG.DB2.V12.SDSNLOAD', 'plan_pklist': '*.CBSAPK.*'}, 'zos_connect_sys_def': {'root': '/var/zosconnect/servers/integration/wazideploy-cics', 'job_name': 'BAQSERV2'}, 'template_name_zosconnect_config': {'src': '../..//deployment-configuration/templates/zos_connect_app_config.xml.j2', 'dest': '/var/zosconnect/servers/integration/wazideploy-cics/configDropins/overrides/{{api_name}}.xml', 'mode': 493, 'delegate': False}, 'system_command_start_server': {'cmd': 'S BAQSERV2', 'verbose': False, 'wait_time_s': 5, 'wait': True}, 'system_command_refresh_config': {'cmd': 'MODIFY BAQSERV2,REFRESH,CONFIG', 'verbose': False, 'wait_time_s': 3, 'wait': True}, 'system_command_refresh_apps': {'cmd': 'MODIFY BAQSERV2,REFRESH,APPS', 'verbose': False, 'wait_time_s': 3, 'wait': True}, 'jcl_expert_verification': {'src': '../..//deployment-configuration/templates/jcl_expert_validation.jcl.j2', 'use_template': True, 'max_rc': 8, 'location': 'LOCAL', 'dest': '/tmp/wazi-deploy/int/jcl_gen/jcl_expert_validation.jcl'}, 'common_pds_load_spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'U', 'record_length': 0, 'block_size': 32760}, 'common_pds_binary_spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'FB', 'record_length': 80, 'block_size': 32720}, 'common_pds_txt_spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'FB', 'record_length': 80}, 'seq_spec': {'type': 'SEQ', 'space_primary': '5TRK', 'space_secondary': '2TRK', 'record_format': 'FB', 'record_length': 20}, 'seq_spec_a': {'type': 'SEQ', 'space_primary': '2TRK', 'space_secondary': '1TRK', 'record_format': 'FB', 'record_length': 15}, 'types': [{'type': 'LOAD', 'pattern': '.*\\.LOAD$', 'pds': {'name': 'IBMUSER.WD.TEST.LOAD', 'backup': 'IBMUSER.WD.TEST.BACK.LOAD', 'spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'U', 'record_length': 0, 'block_size': 32760}}, 'is_load': True, 'force_lock': True, 'force': True, 'use_native_copy': True}, {'type': 'CICSLOAD', 'pattern': '.*\\.CICSLOAD$', 'pds': {'name': 'IBMUSER.WD.TEST.LOAD', 'backup': 'IBMUSER.WD.TEST.BACK.LOAD', 'spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'U', 'record_length': 0, 'block_size': 32760}}, 'is_load': True, 'force_lock': True, 'force': True, 'use_native_copy': True, 'cics_systems': [{'context': 'CICS01', 'cmci_user': 'IBMUSER', 'cmci_password': 'sys1', 'csd_group': 'DEFAULT', 'cmci_host': '127.0.0.1', 'cmci_port': '1490', 'scheme': 'http', 'insecure': False, 'cmci_cert': '', 'cmci_key': ''}]}, {'type': 'MAPLOAD', 'pattern': '.*\\.MAPLOAD$', 'pds': {'name': 'IBMUSER.WD.TEST.LOAD', 'backup': 'IBMUSER.WD.TEST.BACK.LOAD', 'spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'U', 'record_length': 0, 'block_size': 32760}}, 'is_load': True, 'force_lock': True, 'use_native_copy': True, 'cics_systems': [{'context': 'CICS01', 'cmci_user': 'IBMUSER', 'cmci_password': 'sys1', 'csd_group': 'DEFAULT', 'cmci_host': '127.0.0.1', 'cmci_port': '1490', 'scheme': 'http', 'insecure': False, 'cmci_cert': '', 'cmci_key': ''}]}, {'type': 'DBRM', 'pattern': '.*.DBRM$', 'pds': {'name': 'IBMUSER.WD.TEST.DBRM', 'backup': 'IBMUSER.WD.TEST.BACK.DBRM', 'spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'FB', 'record_length': 80, 'block_size': 32720}}, 'is_binary': True, 'force_lock': False, 'use_native_copy': True, 'db2_systems': [{'package_maxrc': 8, 'plan_maxrc': 8, 'sqlid': 'IBMUSER', 'package': 'DEFAULT', 'plan': 'DEFAULT', 'qualifier': 'QUAL', 'subsys': 'DBC1', 'package_jobcard': "BINDPKG JOB 'WD-PKGBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID", 'plan_jobcard': "BINDPLA JOB 'WD-PLANBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID", 'package_action': 'REPLACE', 'plan_action': 'REPLACE', 'sdsnload': 'DBC0CFG.DB2.V12.SDSNLOAD', 'plan_pklist': '*.CBSAPK.*'}]}, {'type': 'JCL', 'pattern': '.*.JCL$', 'pds': {'name': 'IBMUSER.WD.TEST.JCL', 'backup': 'IBMUSER.WD.TEST.BACK.JCL', 'spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'FB', 'record_length': 80}}, 'force_lock': False, 'use_native_copy': True, 'text_subs': '[]'}, {'type': 'BIN', 'pattern': '.*.BIN$', 'uss': {'directory': '/tmp/wazi-deploy/int/bin/', 'directory_backup': '/tmp/wazi-deploy/int/bin/back/', 'dest_mode': 511, 'artifact_mode': 493}, 'is_binary': True, 'use_native_copy': True}, {'type': 'SH', 'pattern': '.*.SH$', 'uss': {'directory': '/tmp/wazi-deploy/int/sh/', 'directory_backup': '/tmp/wazi-deploy/int/sh/back/', 'dest_mode': 511, 'artifact_mode': 493}}, {'type': 'WAR', 'pattern': '.*\\.WAR$', 'uss': {'dest': '/var/zosconnect/servers/integration/wazideploy-cics/apps', 'backup_dest': '/var/zosconnect/servers/integration/wazideploy-cics/backup/apps', 'mode': 493}, 'mode': 511, 'is_binary': True}], 'type_dbrm_temp': [{'type': 'DBRM', 'pattern': '.*.DBRM$', 'pds': {'name': 'IBMUSER.WD.TEST.TMP.DBRM', 'backup': 'IBMUSER.WD.TEST.BACK.TMP.DBRM', 'spec': {'type': 'LIBRARY', 'space_primary': '10CYL', 'space_secondary': '20CYL', 'record_format': 'FB', 'record_length': 80, 'block_size': 32720}}, 'is_binary': True, 'force_lock': False, 'use_native_copy': True, 'db2_systems': [{'package_maxrc': 8, 'plan_maxrc': 8, 'sqlid': 'IBMUSER', 'package': 'DEFAULT', 'plan': 'DEFAULT', 'qualifier': 'QUAL', 'subsys': 'DBC1', 'package_jobcard': "BINDPKG JOB 'WD-PKGBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID", 'plan_jobcard': "BINDPLA JOB 'WD-PLANBIND',MSGLEVEL=(1,1),MSGCLASS=R,NOTIFY=&SYSUID", 'package_action': 'REPLACE', 'plan_action': 'REPLACE', 'sdsnload': 'DBC0CFG.DB2.V12.SDSNLOAD', 'plan_pklist': '*.CBSAPK.*'}]}], 'db2_individual_include_vars_config': {'files_list': ['../..//{{dbrm_member}}.bind.yml'], 'files_must_exist': True}, 'db2_individual_job_template': '../..//deployment-configuration/templates/db2_bind_execution.jcl.j2', 'current_action_name': 'INDIVIDUAL_BIND', 'current_step_name': 'DB2_BIND', 'artifact': {'name': 'EPSCMORT', 'properties': [{'key': 'path', 'value': './bin/dbrm/EPSCMORT.DBRM'}, {'key': 'wd_manifest_index', 'value': 0}, {'key': 'type', 'value': 'DBRM'}], 'hash': 'b6b7850dc9768d4dcfa061599dfebbedd3dc1de48f37eb04f2bad7544ba967bc', 'type': 'DBRM', 'path': './bin/dbrm/EPSCMORT.DBRM'}}
DSN SYSTEM (DBC1)
BIND  PACKAGE(DEFAULT) +
   MEMBER(EPSCMORT) +
   LIBRARY('IBMUSER.WD.TEST.DBRM') +
   QUALIFIER(QUAL) +
   OWNER(IBMUSER) +
   ACTION(REPLACE) +
   ISOLATION(CS) +
   RELEASE(COMMIT) +
   ENCODING(EBCDIC)
END
/*